#include <iostream>
#include <math.h>

using namespace std;

int main()
{   
    
    // 7-1
    cout<< "Лабораторная работа #7.1"<< endl;
    
    double a,b,c,x,y,p;
    cout<<"Введите значение угла a в градусах: ";
    cin>>a;
    p=(a*3.14)/180;
    cout << "Значение угла в радианах: " << p << endl;
    // 7-2
    cout << "Лабораторная работа #7.2" << endl;
    
    cout<<"Введите значение угла a в радианах: ";
    cin>>a;
    p=(a*180)/3.14;
    cout << "Значение угла в градусах: "<<  p << endl;
    
    // 7-3
    cout << "Лабораторная работа #7.3" << endl;
    
    cout << "Введите количество конфет в кг: ";
    cin >> x;
    cout << "Введите стоимость этого кол-ва в руб: ";
    cin >> a;
    b = a/x;
    cout << "Цена этих конфет за 1 кг: " << b <<endl;
    cout << "Сколько килограм этих конфет посчитать: ";
    cin >> y;
    
    c = y*b;
    
    cout << "Стоимость: " << c << endl;
    
    // 7-4
    cout << "Лабораторная работа #7.4" << endl;
    
    double v1,v2,t,s,result;
    cout << "Введите скорость первого автомобиля V1: ";
    cin >> v1;
    cout << "Введите скорость второго автомобиля V2: ";
    cin >> v2;
    cout << "Введите расстояние между ними S: ";
    cin >> s;
    cout << "Введите прошедшее время в часах: ";
    cin >> t;
    result=s+v1*t+v2*t;
    cout << "Между автомобилями: " << result << endl;
    
    // 7-5
    cout << "Лабораторная работа #7.5" << endl;
    
    cout << "Введите коэфициент a: ";
    cin >> a;
    cout << "Введите коэфициент b: ";
    cin >> b;
    x=(-1)*b/a;
    cout << "x равен: " << x << endl;
    
    // 7-6
    cout << "Лабораторная работа #7.6" << endl;
    
    double a1,a2,b1,b2,c1,c2,d,x1,y2;
    
    cout << "a1=: ";
    cin >> a1;
    cout << "a2=: ";
    cin >> a2;
    cout << "b1=: ";
    cin >> b1;
    cout << "b2=: ";
    cin >> b2;
    cout << "c1=: ";
    cin >> c1;
    cout << "c2=: ";
    cin >> c2;
    
    d=a1*b2-a2*b1;
    x1=(c1*b2-c2*b1)/d;
    y2=(a1*c2-a2*c1)/d;
    
    cout << "x равен: " << x1 << endl;
    cout << "y равен: " << y2 << endl;
    
    return 0;
}
