#include <iostream>
#include <math.h>

using namespace std;

int main()
{   
    // 9-1
    cout << "Лабораторная работа #9.1" << endl;
    int n;
    cout<<"Сек: ";
    cin >> n;
    cout << "Количество секунд, прошедших с начала последней минуты: " << n%60 << endl;
    // 9-2
    cout << "Лабораторная работа #9.2" << endl;
    int k;
    cout << "Введите день года: ";
    cin >> k;
    cout << "Номер дня недели: " << k%7<< endl;
    // 9-3
    cout << "Лабораторная работа #9.3" << endl;
    cout << "Введите день года: ";
    cin >> k;
    cout << "Номер дня недели: " << (k)%7+1 << endl;
    // 9-4
    cout << "Лабораторная работа #9.4" << endl;
    double a,b,c;
    cout << "Введите целое число a: ";
    cin >> a;
    cout << "Введите целое число b: ";
    cin >> b;
    cout << "Введите целое число c: ";
    cin >> c;
    cout << "Количество квадратов: " << (a/c)*(b/c)<< endl;
    // 9-5
    cout << "Лабораторная работа #9.5" << endl;
    int year;
    cout << "Введите номер года: ";
    cin >> year;
    cout << "Год столетия: "<< (year-1)/100+1;
}
